Revit 2022 API
ExporterIFC.RegisterShapeForPresentationLayer Method
 Sets an IfcShapeRepresentation to be used for the IfcPresentationLayerAssignment associated with the given Revit category and element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use getLayerNameForPresentationLayer instead.")]
public void RegisterShapeForPresentationLayer(
	Element pElement,
	ElementId categoryId,
	IFCAnyHandle newShapeRepresentation
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use getLayerNameForPresentationLayer instead.")> _
Public Sub RegisterShapeForPresentationLayer ( _
	pElement As Element, _
	categoryId As ElementId, _
	newShapeRepresentation As IFCAnyHandle _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use getLayerNameForPresentationLayer instead.")]
public:
void RegisterShapeForPresentationLayer(
	Element^ pElement,
	ElementId^ categoryId,
	IFCAnyHandle^ newShapeRepresentation
)
Parameters
pElement
Type: Autodesk.Revit.DB.Element
 The element.
categoryId
Type: Autodesk.Revit.DB.ElementId
 The category id.
newShapeRepresentation
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The IfcShapeRepresentation handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace